Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.72/PIC32CM-JH00/include/pio/pic32cm2532jh00100.h
/* ========== PORT definition for PTC peripheral ========== */
#define PIN_PA02B_PTC_DS0                          _UL_(2)     
#define MUX_PA02B_PTC_DS0                          _UL_(1)     
#define PINMUX_PA02B_PTC_DS0                       ((PIN_PA02B_PTC_DS0 << 16) | MUX_PA02B_PTC_DS0)
#define PORT_PA02B_PTC_DS0                         (_UL_(1) << 2)

#define PIN_PA03B_PTC_DS1                          _UL_(3)     
#define MUX_PA03B_PTC_DS1                          _UL_(1)     
#define PINMUX_PA03B_PTC_DS1                       ((PIN_PA03B_PTC_DS1 << 16) | MUX_PA03B_PTC_DS1)
#define PORT_PA03B_PTC_DS1                         (_UL_(1) << 3)

#define PIN_PA04B_PTC_DS2                          _UL_(4)     
#define MUX_PA04B_PTC_DS2                          _UL_(1)     
#define PINMUX_PA04B_PTC_DS2                       ((PIN_PA04B_PTC_DS2 << 16) | MUX_PA04B_PTC_DS2)
#define PORT_PA04B_PTC_DS2                         (_UL_(1) << 4)

#define PIN_PA05B_PTC_DS3                          _UL_(5)     
#define MUX_PA05B_PTC_DS3                          _UL_(1)     
#define PINMUX_PA05B_PTC_DS3                       ((PIN_PA05B_PTC_DS3 << 16) | MUX_PA05B_PTC_DS3)
#define PORT_PA05B_PTC_DS3                         (_UL_(1) << 5)

#define PIN_PA06B_PTC_DS4                          _UL_(6)     
#define MUX_PA06B_PTC_DS4                          _UL_(1)     
#define PINMUX_PA06B_PTC_DS4                       ((PIN_PA06B_PTC_DS4 << 16) | MUX_PA06B_PTC_DS4)
#define PORT_PA06B_PTC_DS4                         (_UL_(1) << 6)

#define PIN_PA07B_PTC_DS5                          _UL_(7)     
#define MUX_PA07B_PTC_DS5                          _UL_(1)     
#define PINMUX_PA07B_PTC_DS5                       ((PIN_PA07B_PTC_DS5 << 16) | MUX_PA07B_PTC_DS5)
#define PORT_PA07B_PTC_DS5                         (_UL_(1) << 7)

#define PIN_PB00B_PTC_DS6                          _UL_(32)    
#define MUX_PB00B_PTC_DS6                          _UL_(1)     
#define PINMUX_PB00B_PTC_DS6                       ((PIN_PB00B_PTC_DS6 << 16) | MUX_PB00B_PTC_DS6)
#define PORT_PB00B_PTC_DS6                         (_UL_(1) << 0)

#define PIN_PB01B_PTC_DS7                          _UL_(33)    
#define MUX_PB01B_PTC_DS7                          _UL_(1)     
#define PINMUX_PB01B_PTC_DS7                       ((PIN_PB01B_PTC_DS7 << 16) | MUX_PB01B_PTC_DS7)
#define PORT_PB01B_PTC_DS7                         (_UL_(1) << 1)

#define PIN_PB02B_PTC_DS8                          _UL_(34)    
#define MUX_PB02B_PTC_DS8                          _UL_(1)     
#define PINMUX_PB02B_PTC_DS8                       ((PIN_PB02B_PTC_DS8 << 16) | MUX_PB02B_PTC_DS8)
#define PORT_PB02B_PTC_DS8                         (_UL_(1) << 2)

#define PIN_PB03B_PTC_DS9                          _UL_(35)    
#define MUX_PB03B_PTC_DS9                          _UL_(1)     
#define PINMUX_PB03B_PTC_DS9                       ((PIN_PB03B_PTC_DS9 << 16) | MUX_PB03B_PTC_DS9)
#define PORT_PB03B_PTC_DS9                         (_UL_(1) << 3)

#define PIN_PB04B_PTC_DS10                         _UL_(36)    
#define MUX_PB04B_PTC_DS10                         _UL_(1)     
#define PINMUX_PB04B_PTC_DS10                      ((PIN_PB04B_PTC_DS10 << 16) | MUX_PB04B_PTC_DS10)
#define PORT_PB04B_PTC_DS10                        (_UL_(1) << 4)

#define PIN_PB05B_PTC_DS11                         _UL_(37)    
#define MUX_PB05B_PTC_DS11                         _UL_(1)     
#define PINMUX_PB05B_PTC_DS11                      ((PIN_PB05B_PTC_DS11 << 16) | MUX_PB05B_PTC_DS11)
#define PORT_PB05B_PTC_DS11                        (_UL_(1) << 5)

#define PIN_PB06B_PTC_DS12                         _UL_(38)    
#define MUX_PB06B_PTC_DS12                         _UL_(1)     
#define PINMUX_PB06B_PTC_DS12                      ((PIN_PB06B_PTC_DS12 << 16) | MUX_PB06B_PTC_DS12)
#define PORT_PB06B_PTC_DS12                        (_UL_(1) << 6)

#define PIN_PB07B_PTC_DS13                         _UL_(39)    
#define MUX_PB07B_PTC_DS13                         _UL_(1)     
#define PINMUX_PB07B_PTC_DS13                      ((PIN_PB07B_PTC_DS13 << 16) | MUX_PB07B_PTC_DS13)
#define PORT_PB07B_PTC_DS13                        (_UL_(1) << 7)

#define PIN_PB08B_PTC_DS14                         _UL_(40)    
#define MUX_PB08B_PTC_DS14                         _UL_(1)     
#define PINMUX_PB08B_PTC_DS14                      ((PIN_PB08B_PTC_DS14 << 16) | MUX_PB08B_PTC_DS14)
#define PORT_PB08B_PTC_DS14                        (_UL_(1) << 8)

#define PIN_PB09B_PTC_DS15                         _UL_(41)    
#define MUX_PB09B_PTC_DS15                         _UL_(1)     
#define PINMUX_PB09B_PTC_DS15                      ((PIN_PB09B_PTC_DS15 << 16) | MUX_PB09B_PTC_DS15)
#define PORT_PB09B_PTC_DS15                        (_UL_(1) << 9)

#define PIN_PA08B_PTC_DS16                         _UL_(8)     
#define MUX_PA08B_PTC_DS16                         _UL_(1)     
#define PINMUX_PA08B_PTC_DS16                      ((PIN_PA08B_PTC_DS16 << 16) | MUX_PA08B_PTC_DS16)
#define PORT_PA08B_PTC_DS16                        (_UL_(1) << 8)

#define PIN_PA09B_PTC_DS17                         _UL_(9)     
#define MUX_PA09B_PTC_DS17                         _UL_(1)     
#define PINMUX_PA09B_PTC_DS17                      ((PIN_PA09B_PTC_DS17 << 16) | MUX_PA09B_PTC_DS17)
#define PORT_PA09B_PTC_DS17                        (_UL_(1) << 9)

#define PIN_PA10B_PTC_DS18                         _UL_(10)    
#define MUX_PA10B_PTC_DS18                         _UL_(1)     
#define PINMUX_PA10B_PTC_DS18                      ((PIN_PA10B_PTC_DS18 << 16) | MUX_PA10B_PTC_DS18)
#define PORT_PA10B_PTC_DS18                        (_UL_(1) << 10)

#define PIN_PA11B_PTC_DS19                         _UL_(11)    
#define MUX_PA11B_PTC_DS19                         _UL_(1)     
#define PINMUX_PA11B_PTC_DS19                      ((PIN_PA11B_PTC_DS19 << 16) | MUX_PA11B_PTC_DS19)
#define PORT_PA11B_PTC_DS19                        (_UL_(1) << 11)

#define PIN_PA16B_PTC_DS20                         _UL_(16)    
#define MUX_PA16B_PTC_DS20                         _UL_(1)     
#define PINMUX_PA16B_PTC_DS20                      ((PIN_PA16B_PTC_DS20 << 16) | MUX_PA16B_PTC_DS20)
#define PORT_PA16B_PTC_DS20                        (_UL_(1) << 16)

#define PIN_PA17B_PTC_DS21                         _UL_(17)    
#define MUX_PA17B_PTC_DS21                         _UL_(1)     
#define PINMUX_PA17B_PTC_DS21                      ((PIN_PA17B_PTC_DS21 << 16) | MUX_PA17B_PTC_DS21)
#define PORT_PA17B_PTC_DS21                        (_UL_(1) << 17)

#define PIN_PA18B_PTC_DS22                         _UL_(18)    
#define MUX_PA18B_PTC_DS22                         _UL_(1)     
#define PINMUX_PA18B_PTC_DS22                      ((PIN_PA18B_PTC_DS22 << 16) | MUX_PA18B_PTC_DS22)
#define PORT_PA18B_PTC_DS22                        (_UL_(1) << 18)

