Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.72/PIC32CM-JH00/include/pio/pic32cm2532jh00100.h
#define PIN_PB09E_TC0_WO1                          _UL_(41)    
#define MUX_PB09E_TC0_WO1                          _UL_(4)     
#define PINMUX_PB09E_TC0_WO1                       ((PIN_PB09E_TC0_WO1 << 16) | MUX_PB09E_TC0_WO1)
#define PORT_PB09E_TC0_WO1                         (_UL_(1) << 9)

#define PIN_PB13E_TC0_WO1                          _UL_(45)    
#define MUX_PB13E_TC0_WO1                          _UL_(4)     
#define PINMUX_PB13E_TC0_WO1                       ((PIN_PB13E_TC0_WO1 << 16) | MUX_PB13E_TC0_WO1)
#define PORT_PB13E_TC0_WO1                         (_UL_(1) << 13)

/* ========== PORT definition for TC1 peripheral ========== */
#define PIN_PA24E_TC1_WO0                          _UL_(24)    
#define MUX_PA24E_TC1_WO0                          _UL_(4)     
#define PINMUX_PA24E_TC1_WO0                       ((PIN_PA24E_TC1_WO0 << 16) | MUX_PA24E_TC1_WO0)
#define PORT_PA24E_TC1_WO0                         (_UL_(1) << 24)

#define PIN_PB10E_TC1_WO0                          _UL_(42)    
#define MUX_PB10E_TC1_WO0                          _UL_(4)     
#define PINMUX_PB10E_TC1_WO0                       ((PIN_PB10E_TC1_WO0 << 16) | MUX_PB10E_TC1_WO0)
#define PORT_PB10E_TC1_WO0                         (_UL_(1) << 10)

#define PIN_PB14E_TC1_WO0                          _UL_(46)    
#define MUX_PB14E_TC1_WO0                          _UL_(4)     
#define PINMUX_PB14E_TC1_WO0                       ((PIN_PB14E_TC1_WO0 << 16) | MUX_PB14E_TC1_WO0)
#define PORT_PB14E_TC1_WO0                         (_UL_(1) << 14)

#define PIN_PA25E_TC1_WO1                          _UL_(25)    
#define MUX_PA25E_TC1_WO1                          _UL_(4)     
#define PINMUX_PA25E_TC1_WO1                       ((PIN_PA25E_TC1_WO1 << 16) | MUX_PA25E_TC1_WO1)
#define PORT_PA25E_TC1_WO1                         (_UL_(1) << 25)

#define PIN_PB11E_TC1_WO1                          _UL_(43)    
#define MUX_PB11E_TC1_WO1                          _UL_(4)     
#define PINMUX_PB11E_TC1_WO1                       ((PIN_PB11E_TC1_WO1 << 16) | MUX_PB11E_TC1_WO1)
#define PORT_PB11E_TC1_WO1                         (_UL_(1) << 11)

#define PIN_PB15E_TC1_WO1                          _UL_(47)    
#define MUX_PB15E_TC1_WO1                          _UL_(4)     
#define PINMUX_PB15E_TC1_WO1                       ((PIN_PB15E_TC1_WO1 << 16) | MUX_PB15E_TC1_WO1)
#define PORT_PB15E_TC1_WO1                         (_UL_(1) << 15)

/* ========== PORT definition for TC2 peripheral ========== */
#define PIN_PB02E_TC2_WO0                          _UL_(34)    
#define MUX_PB02E_TC2_WO0                          _UL_(4)     
#define PINMUX_PB02E_TC2_WO0                       ((PIN_PB02E_TC2_WO0 << 16) | MUX_PB02E_TC2_WO0)
#define PORT_PB02E_TC2_WO0                         (_UL_(1) << 2)

#define PIN_PB16E_TC2_WO0                          _UL_(48)    
#define MUX_PB16E_TC2_WO0                          _UL_(4)     
#define PINMUX_PB16E_TC2_WO0                       ((PIN_PB16E_TC2_WO0 << 16) | MUX_PB16E_TC2_WO0)
#define PORT_PB16E_TC2_WO0                         (_UL_(1) << 16)

#define PIN_PB03E_TC2_WO1                          _UL_(35)    
#define MUX_PB03E_TC2_WO1                          _UL_(4)     
#define PINMUX_PB03E_TC2_WO1                       ((PIN_PB03E_TC2_WO1 << 16) | MUX_PB03E_TC2_WO1)
#define PORT_PB03E_TC2_WO1                         (_UL_(1) << 3)

#define PIN_PB17E_TC2_WO1                          _UL_(49)    
#define MUX_PB17E_TC2_WO1                          _UL_(4)     
#define PINMUX_PB17E_TC2_WO1                       ((PIN_PB17E_TC2_WO1 << 16) | MUX_PB17E_TC2_WO1)
#define PORT_PB17E_TC2_WO1                         (_UL_(1) << 17)

/* ========== PORT definition for TC3 peripheral ========== */
#define PIN_PA20E_TC3_WO0                          _UL_(20)    
#define MUX_PA20E_TC3_WO0                          _UL_(4)     
#define PINMUX_PA20E_TC3_WO0                       ((PIN_PA20E_TC3_WO0 << 16) | MUX_PA20E_TC3_WO0)
#define PORT_PA20E_TC3_WO0                         (_UL_(1) << 20)

#define PIN_PB00E_TC3_WO0                          _UL_(32)    
#define MUX_PB00E_TC3_WO0                          _UL_(4)     
#define PINMUX_PB00E_TC3_WO0                       ((PIN_PB00E_TC3_WO0 << 16) | MUX_PB00E_TC3_WO0)
#define PORT_PB00E_TC3_WO0                         (_UL_(1) << 0)

#define PIN_PB22E_TC3_WO0                          _UL_(54)    
#define MUX_PB22E_TC3_WO0                          _UL_(4)     
#define PINMUX_PB22E_TC3_WO0                       ((PIN_PB22E_TC3_WO0 << 16) | MUX_PB22E_TC3_WO0)
#define PORT_PB22E_TC3_WO0                         (_UL_(1) << 22)

#define PIN_PA21E_TC3_WO1                          _UL_(21)    
#define MUX_PA21E_TC3_WO1                          _UL_(4)     
#define PINMUX_PA21E_TC3_WO1                       ((PIN_PA21E_TC3_WO1 << 16) | MUX_PA21E_TC3_WO1)
#define PORT_PA21E_TC3_WO1                         (_UL_(1) << 21)

#define PIN_PB01E_TC3_WO1                          _UL_(33)    
#define MUX_PB01E_TC3_WO1                          _UL_(4)     
#define PINMUX_PB01E_TC3_WO1                       ((PIN_PB01E_TC3_WO1 << 16) | MUX_PB01E_TC3_WO1)
#define PORT_PB01E_TC3_WO1                         (_UL_(1) << 1)

#define PIN_PB23E_TC3_WO1                          _UL_(55)    
#define MUX_PB23E_TC3_WO1                          _UL_(4)     
#define PINMUX_PB23E_TC3_WO1                       ((PIN_PB23E_TC3_WO1 << 16) | MUX_PB23E_TC3_WO1)
#define PORT_PB23E_TC3_WO1                         (_UL_(1) << 23)

/* ========== PORT definition for TC4 peripheral ========== */
#define PIN_PA18E_TC4_WO0                          _UL_(18)    
#define MUX_PA18E_TC4_WO0                          _UL_(4)     
#define PINMUX_PA18E_TC4_WO0                       ((PIN_PA18E_TC4_WO0 << 16) | MUX_PA18E_TC4_WO0)
#define PORT_PA18E_TC4_WO0                         (_UL_(1) << 18)

#define PIN_PA14E_TC4_WO0                          _UL_(14)    
#define MUX_PA14E_TC4_WO0                          _UL_(4)     
#define PINMUX_PA14E_TC4_WO0                       ((PIN_PA14E_TC4_WO0 << 16) | MUX_PA14E_TC4_WO0)
#define PORT_PA14E_TC4_WO0                         (_UL_(1) << 14)

#define PIN_PA19E_TC4_WO1                          _UL_(19)    
#define MUX_PA19E_TC4_WO1                          _UL_(4)     
#define PINMUX_PA19E_TC4_WO1                       ((PIN_PA19E_TC4_WO1 << 16) | MUX_PA19E_TC4_WO1)
#define PORT_PA19E_TC4_WO1                         (_UL_(1) << 19)

#define PIN_PA15E_TC4_WO1                          _UL_(15)    
#define MUX_PA15E_TC4_WO1                          _UL_(4)     
#define PINMUX_PA15E_TC4_WO1                       ((PIN_PA15E_TC4_WO1 << 16) | MUX_PA15E_TC4_WO1)
#define PORT_PA15E_TC4_WO1                         (_UL_(1) << 15)

