Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.72/PIC32CM-JH00/include/pio/pic32cm2532jh00100.h
/* ========== PORT definition for TC5 peripheral ========== */
#define PIN_PA04F_TC5_WO0                          _UL_(4)     
#define MUX_PA04F_TC5_WO0                          _UL_(5)     
#define PINMUX_PA04F_TC5_WO0                       ((PIN_PA04F_TC5_WO0 << 16) | MUX_PA04F_TC5_WO0)
#define PORT_PA04F_TC5_WO0                         (_UL_(1) << 4)

#define PIN_PB02F_TC5_WO0                          _UL_(34)    
#define MUX_PB02F_TC5_WO0                          _UL_(5)     
#define PINMUX_PB02F_TC5_WO0                       ((PIN_PB02F_TC5_WO0 << 16) | MUX_PB02F_TC5_WO0)
#define PORT_PB02F_TC5_WO0                         (_UL_(1) << 2)

#define PIN_PA05F_TC5_WO1                          _UL_(5)     
#define MUX_PA05F_TC5_WO1                          _UL_(5)     
#define PINMUX_PA05F_TC5_WO1                       ((PIN_PA05F_TC5_WO1 << 16) | MUX_PA05F_TC5_WO1)
#define PORT_PA05F_TC5_WO1                         (_UL_(1) << 5)

#define PIN_PB03F_TC5_WO1                          _UL_(35)    
#define MUX_PB03F_TC5_WO1                          _UL_(5)     
#define PINMUX_PB03F_TC5_WO1                       ((PIN_PB03F_TC5_WO1 << 16) | MUX_PB03F_TC5_WO1)
#define PORT_PB03F_TC5_WO1                         (_UL_(1) << 3)

/* ========== PORT definition for TC6 peripheral ========== */
#define PIN_PA06F_TC6_WO0                          _UL_(6)     
#define MUX_PA06F_TC6_WO0                          _UL_(5)     
#define PINMUX_PA06F_TC6_WO0                       ((PIN_PA06F_TC6_WO0 << 16) | MUX_PA06F_TC6_WO0)
#define PORT_PA06F_TC6_WO0                         (_UL_(1) << 6)

#define PIN_PB00F_TC6_WO0                          _UL_(32)    
#define MUX_PB00F_TC6_WO0                          _UL_(5)     
#define PINMUX_PB00F_TC6_WO0                       ((PIN_PB00F_TC6_WO0 << 16) | MUX_PB00F_TC6_WO0)
#define PORT_PB00F_TC6_WO0                         (_UL_(1) << 0)

#define PIN_PA07F_TC6_WO1                          _UL_(7)     
#define MUX_PA07F_TC6_WO1                          _UL_(5)     
#define PINMUX_PA07F_TC6_WO1                       ((PIN_PA07F_TC6_WO1 << 16) | MUX_PA07F_TC6_WO1)
#define PORT_PA07F_TC6_WO1                         (_UL_(1) << 7)

#define PIN_PB01F_TC6_WO1                          _UL_(33)    
#define MUX_PB01F_TC6_WO1                          _UL_(5)     
#define PINMUX_PB01F_TC6_WO1                       ((PIN_PB01F_TC6_WO1 << 16) | MUX_PB01F_TC6_WO1)
#define PORT_PB01F_TC6_WO1                         (_UL_(1) << 1)

/* ========== PORT definition for TC7 peripheral ========== */
#define PIN_PA00F_TC7_WO0                          _UL_(0)     
#define MUX_PA00F_TC7_WO0                          _UL_(5)     
#define PINMUX_PA00F_TC7_WO0                       ((PIN_PA00F_TC7_WO0 << 16) | MUX_PA00F_TC7_WO0)
#define PORT_PA00F_TC7_WO0                         (_UL_(1) << 0)

#define PIN_PB14F_TC7_WO0                          _UL_(46)    
#define MUX_PB14F_TC7_WO0                          _UL_(5)     
#define PINMUX_PB14F_TC7_WO0                       ((PIN_PB14F_TC7_WO0 << 16) | MUX_PB14F_TC7_WO0)
#define PORT_PB14F_TC7_WO0                         (_UL_(1) << 14)

#define PIN_PA01F_TC7_WO1                          _UL_(1)     
#define MUX_PA01F_TC7_WO1                          _UL_(5)     
#define PINMUX_PA01F_TC7_WO1                       ((PIN_PA01F_TC7_WO1 << 16) | MUX_PA01F_TC7_WO1)
#define PORT_PA01F_TC7_WO1                         (_UL_(1) << 1)

#define PIN_PB15F_TC7_WO1                          _UL_(47)    
#define MUX_PB15F_TC7_WO1                          _UL_(5)     
#define PINMUX_PB15F_TC7_WO1                       ((PIN_PB15F_TC7_WO1 << 16) | MUX_PB15F_TC7_WO1)
#define PORT_PB15F_TC7_WO1                         (_UL_(1) << 15)

/* ========== PORT definition for TCC0 peripheral ========== */
#define PIN_PA04E_TCC0_WO0                         _UL_(4)     
#define MUX_PA04E_TCC0_WO0                         _UL_(4)     
#define PINMUX_PA04E_TCC0_WO0                      ((PIN_PA04E_TCC0_WO0 << 16) | MUX_PA04E_TCC0_WO0)
#define PORT_PA04E_TCC0_WO0                        (_UL_(1) << 4)

#define PIN_PA08E_TCC0_WO0                         _UL_(8)     
#define MUX_PA08E_TCC0_WO0                         _UL_(4)     
#define PINMUX_PA08E_TCC0_WO0                      ((PIN_PA08E_TCC0_WO0 << 16) | MUX_PA08E_TCC0_WO0)
#define PORT_PA08E_TCC0_WO0                        (_UL_(1) << 8)

#define PIN_PB30E_TCC0_WO0                         _UL_(62)    
#define MUX_PB30E_TCC0_WO0                         _UL_(4)     
#define PINMUX_PB30E_TCC0_WO0                      ((PIN_PB30E_TCC0_WO0 << 16) | MUX_PB30E_TCC0_WO0)
#define PORT_PB30E_TCC0_WO0                        (_UL_(1) << 30)

#define PIN_PA05E_TCC0_WO1                         _UL_(5)     
#define MUX_PA05E_TCC0_WO1                         _UL_(4)     
#define PINMUX_PA05E_TCC0_WO1                      ((PIN_PA05E_TCC0_WO1 << 16) | MUX_PA05E_TCC0_WO1)
#define PORT_PA05E_TCC0_WO1                        (_UL_(1) << 5)

#define PIN_PA09E_TCC0_WO1                         _UL_(9)     
#define MUX_PA09E_TCC0_WO1                         _UL_(4)     
#define PINMUX_PA09E_TCC0_WO1                      ((PIN_PA09E_TCC0_WO1 << 16) | MUX_PA09E_TCC0_WO1)
#define PORT_PA09E_TCC0_WO1                        (_UL_(1) << 9)

#define PIN_PB31E_TCC0_WO1                         _UL_(63)    
#define MUX_PB31E_TCC0_WO1                         _UL_(4)     
#define PINMUX_PB31E_TCC0_WO1                      ((PIN_PB31E_TCC0_WO1 << 16) | MUX_PB31E_TCC0_WO1)
#define PORT_PB31E_TCC0_WO1                        (_UL_(1) << 31)

#define PIN_PA10F_TCC0_WO2                         _UL_(10)    
#define MUX_PA10F_TCC0_WO2                         _UL_(5)     
#define PINMUX_PA10F_TCC0_WO2                      ((PIN_PA10F_TCC0_WO2 << 16) | MUX_PA10F_TCC0_WO2)
#define PORT_PA10F_TCC0_WO2                        (_UL_(1) << 10)

#define PIN_PA18F_TCC0_WO2                         _UL_(18)    
#define MUX_PA18F_TCC0_WO2                         _UL_(5)     
#define PINMUX_PA18F_TCC0_WO2                      ((PIN_PA18F_TCC0_WO2 << 16) | MUX_PA18F_TCC0_WO2)
#define PORT_PA18F_TCC0_WO2                        (_UL_(1) << 18)

#define PIN_PA11F_TCC0_WO3                         _UL_(11)    
#define MUX_PA11F_TCC0_WO3                         _UL_(5)     
#define PINMUX_PA11F_TCC0_WO3                      ((PIN_PA11F_TCC0_WO3 << 16) | MUX_PA11F_TCC0_WO3)
#define PORT_PA11F_TCC0_WO3                        (_UL_(1) << 11)

#define PIN_PA19F_TCC0_WO3                         _UL_(19)    
#define MUX_PA19F_TCC0_WO3                         _UL_(5)     
#define PINMUX_PA19F_TCC0_WO3                      ((PIN_PA19F_TCC0_WO3 << 16) | MUX_PA19F_TCC0_WO3)
#define PORT_PA19F_TCC0_WO3                        (_UL_(1) << 19)

#define PIN_PA22F_TCC0_WO4                         _UL_(22)    
#define MUX_PA22F_TCC0_WO4                         _UL_(5)     
#define PINMUX_PA22F_TCC0_WO4                      ((PIN_PA22F_TCC0_WO4 << 16) | MUX_PA22F_TCC0_WO4)
#define PORT_PA22F_TCC0_WO4                        (_UL_(1) << 22)

#define PIN_PB10F_TCC0_WO4                         _UL_(42)    
#define MUX_PB10F_TCC0_WO4                         _UL_(5)     
#define PINMUX_PB10F_TCC0_WO4                      ((PIN_PB10F_TCC0_WO4 << 16) | MUX_PB10F_TCC0_WO4)
#define PORT_PB10F_TCC0_WO4                        (_UL_(1) << 10)

#define PIN_PB16F_TCC0_WO4                         _UL_(48)    
#define MUX_PB16F_TCC0_WO4                         _UL_(5)     
#define PINMUX_PB16F_TCC0_WO4                      ((PIN_PB16F_TCC0_WO4 << 16) | MUX_PB16F_TCC0_WO4)
#define PORT_PB16F_TCC0_WO4                        (_UL_(1) << 16)

#define PIN_PA14F_TCC0_WO4                         _UL_(14)    
#define MUX_PA14F_TCC0_WO4                         _UL_(5)     
#define PINMUX_PA14F_TCC0_WO4                      ((PIN_PA14F_TCC0_WO4 << 16) | MUX_PA14F_TCC0_WO4)
#define PORT_PA14F_TCC0_WO4                        (_UL_(1) << 14)

#define PIN_PA15F_TCC0_WO5                         _UL_(15)    
#define MUX_PA15F_TCC0_WO5                         _UL_(5)     
#define PINMUX_PA15F_TCC0_WO5                      ((PIN_PA15F_TCC0_WO5 << 16) | MUX_PA15F_TCC0_WO5)
#define PORT_PA15F_TCC0_WO5                        (_UL_(1) << 15)

